app/views/messages/index.html.haml

SELECT  `employees`.* FROM `employees`   ORDER BY `employees`.`id` ASC LIMIT 1
---
	var get_active_lovedones = function(){
		$.get('/companies/'+company_id+'/active_lovedones', function(response){
			var html = '';
			var button1_disabled, button2_disabled, button3_disabled;
			response.active_lovedones.map(function(o){
				var status = o.status;
				var trip_id = o.trip_id;
				var employee_id = o.employee_id;
				var o = o.lovedone;
				html += "<tr>";
				html += "<td>"+o.last_name + ", " + o.first_name+"</td>";
				html += "<td>"+o.date_of_birth+"</td>";
				button1_disabled='', button2_disabled='', button3_disabled='';
				switch(status){
					case 'active':
						button2_disabled = 'disabled';
					break;
					case 'started':
						button1_disabled = 'disabled';
						button2_disabled = '';
						button3_disabled = 'disabled';
					break;