app/controllers/companies_controller.rb

SELECT  `companies`.* FROM `companies`  WHERE `companies`.`id` = 44 LIMIT 1
SELECT `providers`.`lovedone_id` FROM `providers`  WHERE `providers`.`company_id` = 44
SELECT `lovedones`.* FROM `lovedones`  WHERE `lovedones`.`id` IN (15, 16)
---
  def lovedones
    @company = Company.find(params[:id])
    ids = @company.providers.pluck('lovedone_id')
    @lovedones = Lovedone.where(id: ids)

SELECT  `companies`.* FROM `companies`  WHERE `companies`.`id` = 44 LIMIT 1
SELECT `providers`.`lovedone_id` FROM `providers`  WHERE `providers`.`company_id` = 44
SELECT `lovedones`.* FROM `lovedones`  WHERE `lovedones`.`id` IN (15, 16)
SELECT id, lovedone_id, status, employee_id FROM `trips`  WHERE `trips`.`status` IN ('active', 'started')
---
  def active_lovedones
    @company = Company.find(params[:id])
    ids = @company.providers.pluck('lovedone_id')
    @lovedones = Lovedone.where(id: ids)
    @active_trips = Trip.where(status: ['active', 'started']).all.pluck('id, lovedone_id, status, employee_id')