app/controllers/employees_controller.rb

SELECT  `companies`.* FROM `companies`  WHERE `companies`.`id` = 44 LIMIT 1
---
  def track
    @company = Company.find(params[:company_id])