app/controllers/messages_controller.rb

  def index
  	@company = current_user.company
  	@employee = Employee.first
---
SELECT  `employees`.* FROM `employees`   ORDER BY `employees`.`id` ASC LIMIT 1